; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport three-cities-sequential-6nodes-1000size-5degree-100mindistance-5trucks-2packages-1199seed

(define (problem transport-three-cities-sequential-6nodes-1000size-5degree-100mindistance-5trucks-2packages-1199seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-3-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-3-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-3-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-3-loc-4 - location
  city-1-loc-5 - location
  city-2-loc-5 - location
  city-3-loc-5 - location
  city-1-loc-6 - location
  city-2-loc-6 - location
  city-3-loc-6 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  truck-4 - vehicle
  truck-5 - vehicle
  package-1 - package
  package-2 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 701,224 -> 947,766
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 60)
  ; 947,766 -> 701,224
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 60)
  ; 439,95 -> 95,519
  (road city-1-loc-4 city-1-loc-2)
  (= (road-length city-1-loc-4 city-1-loc-2) 55)
  ; 95,519 -> 439,95
  (road city-1-loc-2 city-1-loc-4)
  (= (road-length city-1-loc-2 city-1-loc-4) 55)
  ; 439,95 -> 701,224
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 30)
  ; 701,224 -> 439,95
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 30)
  ; 403,318 -> 95,519
  (road city-1-loc-5 city-1-loc-2)
  (= (road-length city-1-loc-5 city-1-loc-2) 37)
  ; 95,519 -> 403,318
  (road city-1-loc-2 city-1-loc-5)
  (= (road-length city-1-loc-2 city-1-loc-5) 37)
  ; 403,318 -> 701,224
  (road city-1-loc-5 city-1-loc-3)
  (= (road-length city-1-loc-5 city-1-loc-3) 32)
  ; 701,224 -> 403,318
  (road city-1-loc-3 city-1-loc-5)
  (= (road-length city-1-loc-3 city-1-loc-5) 32)
  ; 403,318 -> 439,95
  (road city-1-loc-5 city-1-loc-4)
  (= (road-length city-1-loc-5 city-1-loc-4) 23)
  ; 439,95 -> 403,318
  (road city-1-loc-4 city-1-loc-5)
  (= (road-length city-1-loc-4 city-1-loc-5) 23)
  ; 247,882 -> 95,519
  (road city-1-loc-6 city-1-loc-2)
  (= (road-length city-1-loc-6 city-1-loc-2) 40)
  ; 95,519 -> 247,882
  (road city-1-loc-2 city-1-loc-6)
  (= (road-length city-1-loc-2 city-1-loc-6) 40)
  ; 247,882 -> 403,318
  (road city-1-loc-6 city-1-loc-5)
  (= (road-length city-1-loc-6 city-1-loc-5) 59)
  ; 403,318 -> 247,882
  (road city-1-loc-5 city-1-loc-6)
  (= (road-length city-1-loc-5 city-1-loc-6) 59)
  ; 2743,868 -> 2751,739
  (road city-2-loc-4 city-2-loc-3)
  (= (road-length city-2-loc-4 city-2-loc-3) 13)
  ; 2751,739 -> 2743,868
  (road city-2-loc-3 city-2-loc-4)
  (= (road-length city-2-loc-3 city-2-loc-4) 13)
  ; 2694,115 -> 2766,7
  (road city-2-loc-5 city-2-loc-2)
  (= (road-length city-2-loc-5 city-2-loc-2) 13)
  ; 2766,7 -> 2694,115
  (road city-2-loc-2 city-2-loc-5)
  (= (road-length city-2-loc-2 city-2-loc-5) 13)
  ; 2540,648 -> 2123,587
  (road city-2-loc-6 city-2-loc-1)
  (= (road-length city-2-loc-6 city-2-loc-1) 43)
  ; 2123,587 -> 2540,648
  (road city-2-loc-1 city-2-loc-6)
  (= (road-length city-2-loc-1 city-2-loc-6) 43)
  ; 2540,648 -> 2751,739
  (road city-2-loc-6 city-2-loc-3)
  (= (road-length city-2-loc-6 city-2-loc-3) 23)
  ; 2751,739 -> 2540,648
  (road city-2-loc-3 city-2-loc-6)
  (= (road-length city-2-loc-3 city-2-loc-6) 23)
  ; 2540,648 -> 2743,868
  (road city-2-loc-6 city-2-loc-4)
  (= (road-length city-2-loc-6 city-2-loc-4) 30)
  ; 2743,868 -> 2540,648
  (road city-2-loc-4 city-2-loc-6)
  (= (road-length city-2-loc-4 city-2-loc-6) 30)
  ; 2540,648 -> 2694,115
  (road city-2-loc-6 city-2-loc-5)
  (= (road-length city-2-loc-6 city-2-loc-5) 56)
  ; 2694,115 -> 2540,648
  (road city-2-loc-5 city-2-loc-6)
  (= (road-length city-2-loc-5 city-2-loc-6) 56)
  ; 1305,2704 -> 1673,2767
  (road city-3-loc-3 city-3-loc-2)
  (= (road-length city-3-loc-3 city-3-loc-2) 38)
  ; 1673,2767 -> 1305,2704
  (road city-3-loc-2 city-3-loc-3)
  (= (road-length city-3-loc-2 city-3-loc-3) 38)
  ; 1846,2919 -> 1673,2767
  (road city-3-loc-4 city-3-loc-2)
  (= (road-length city-3-loc-4 city-3-loc-2) 23)
  ; 1673,2767 -> 1846,2919
  (road city-3-loc-2 city-3-loc-4)
  (= (road-length city-3-loc-2 city-3-loc-4) 23)
  ; 1846,2919 -> 1305,2704
  (road city-3-loc-4 city-3-loc-3)
  (= (road-length city-3-loc-4 city-3-loc-3) 59)
  ; 1305,2704 -> 1846,2919
  (road city-3-loc-3 city-3-loc-4)
  (= (road-length city-3-loc-3 city-3-loc-4) 59)
  ; 1528,2294 -> 1701,2118
  (road city-3-loc-5 city-3-loc-1)
  (= (road-length city-3-loc-5 city-3-loc-1) 25)
  ; 1701,2118 -> 1528,2294
  (road city-3-loc-1 city-3-loc-5)
  (= (road-length city-3-loc-1 city-3-loc-5) 25)
  ; 1528,2294 -> 1673,2767
  (road city-3-loc-5 city-3-loc-2)
  (= (road-length city-3-loc-5 city-3-loc-2) 50)
  ; 1673,2767 -> 1528,2294
  (road city-3-loc-2 city-3-loc-5)
  (= (road-length city-3-loc-2 city-3-loc-5) 50)
  ; 1528,2294 -> 1305,2704
  (road city-3-loc-5 city-3-loc-3)
  (= (road-length city-3-loc-5 city-3-loc-3) 47)
  ; 1305,2704 -> 1528,2294
  (road city-3-loc-3 city-3-loc-5)
  (= (road-length city-3-loc-3 city-3-loc-5) 47)
  ; 1172,2960 -> 1673,2767
  (road city-3-loc-6 city-3-loc-2)
  (= (road-length city-3-loc-6 city-3-loc-2) 54)
  ; 1673,2767 -> 1172,2960
  (road city-3-loc-2 city-3-loc-6)
  (= (road-length city-3-loc-2 city-3-loc-6) 54)
  ; 1172,2960 -> 1305,2704
  (road city-3-loc-6 city-3-loc-3)
  (= (road-length city-3-loc-6 city-3-loc-3) 29)
  ; 1305,2704 -> 1172,2960
  (road city-3-loc-3 city-3-loc-6)
  (= (road-length city-3-loc-3 city-3-loc-6) 29)
  ; 947,766 <-> 2123,587
  (road city-1-loc-1 city-2-loc-1)
  (= (road-length city-1-loc-1 city-2-loc-1) 119)
  (road city-2-loc-1 city-1-loc-1)
  (= (road-length city-2-loc-1 city-1-loc-1) 119)
  (road city-1-loc-1 city-3-loc-1)
  (= (road-length city-1-loc-1 city-3-loc-1) 119)
  (road city-3-loc-1 city-1-loc-1)
  (= (road-length city-3-loc-1 city-1-loc-1) 119)
  (road city-2-loc-1 city-3-loc-1)
  (= (road-length city-2-loc-1 city-3-loc-1) 119)
  (road city-3-loc-1 city-2-loc-1)
  (= (road-length city-3-loc-1 city-2-loc-1) 119)
  (at package-1 city-3-loc-6)
  (at package-2 city-2-loc-3)
  (at truck-1 city-1-loc-4)
  (capacity truck-1 capacity-3)
  (at truck-2 city-3-loc-4)
  (capacity truck-2 capacity-4)
  (at truck-3 city-3-loc-6)
  (capacity truck-3 capacity-4)
  (at truck-4 city-3-loc-1)
  (capacity truck-4 capacity-2)
  (at truck-5 city-1-loc-6)
  (capacity truck-5 capacity-4)
 )
 (:goal (and
  (at package-1 city-1-loc-5)
  (at package-2 city-1-loc-5)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (pick-up truck-3 city-3-loc-6 package-1 capacity-3 capacity-4)
   deleted: (at package-1 city-3-loc-6) (capacity truck-3 capacity-4)
   added: (in package-1 truck-3) (capacity truck-3 capacity-3)
   goals met: 0 of 2
2. (drive truck-3 city-3-loc-6 city-3-loc-2)
   deleted: (at truck-3 city-3-loc-6)
   added: (at truck-3 city-3-loc-2)
   goals met: 0 of 2
3. (drive truck-3 city-3-loc-2 city-3-loc-5)
   deleted: (at truck-3 city-3-loc-2)
   added: (at truck-3 city-3-loc-5)
   goals met: 0 of 2
4. (drive truck-3 city-3-loc-5 city-3-loc-1)
   deleted: (at truck-3 city-3-loc-5)
   added: (at truck-3 city-3-loc-1)
   goals met: 0 of 2
5. (drive truck-3 city-3-loc-1 city-2-loc-1)
   deleted: (at truck-3 city-3-loc-1)
   added: (at truck-3 city-2-loc-1)
   goals met: 0 of 2
6. (drive truck-3 city-2-loc-1 city-2-loc-6)
   deleted: (at truck-3 city-2-loc-1)
   added: (at truck-3 city-2-loc-6)
   goals met: 0 of 2
7. (drive truck-3 city-2-loc-6 city-2-loc-3)
   deleted: (at truck-3 city-2-loc-6)
   added: (at truck-3 city-2-loc-3)
   goals met: 0 of 2
8. (pick-up truck-3 city-2-loc-3 package-2 capacity-2 capacity-3)
   deleted: (at package-2 city-2-loc-3) (capacity truck-3 capacity-3)
   added: (in package-2 truck-3) (capacity truck-3 capacity-2)
   goals met: 0 of 2
9. (drive truck-3 city-2-loc-3 city-2-loc-6)
   deleted: (at truck-3 city-2-loc-3)
   added: (at truck-3 city-2-loc-6)
   goals met: 0 of 2
10. (drive truck-3 city-2-loc-6 city-2-loc-1)
   deleted: (at truck-3 city-2-loc-6)
   added: (at truck-3 city-2-loc-1)
   goals met: 0 of 2
11. (drive truck-3 city-2-loc-1 city-1-loc-1)
   deleted: (at truck-3 city-2-loc-1)
   added: (at truck-3 city-1-loc-1)
   goals met: 0 of 2
12. (drive truck-3 city-1-loc-1 city-1-loc-3)
   deleted: (at truck-3 city-1-loc-1)
   added: (at truck-3 city-1-loc-3)
   goals met: 0 of 2
13. (drive truck-3 city-1-loc-3 city-1-loc-5)
   deleted: (at truck-3 city-1-loc-3)
   added: (at truck-3 city-1-loc-5)
   goals met: 0 of 2
14. (drop truck-3 city-1-loc-5 package-1 capacity-2 capacity-3)
   deleted: (in package-1 truck-3) (capacity truck-3 capacity-2)
   added: (at package-1 city-1-loc-5) (capacity truck-3 capacity-3)
   goals met: 1 of 2
15. (drop truck-3 city-1-loc-5 package-2 capacity-3 capacity-4)
   deleted: (in package-2 truck-3) (capacity truck-3 capacity-3)
   added: (at package-2 city-1-loc-5) (capacity truck-3 capacity-4)
   goals met: 2 of 2
